*Exercise 1*
Below are various data sources. Identify whether each one is an example of structured or unstructured data.
A companyâ€™s financial reports stored in an Excel file. - structured
Photographs uploaded to a social media platform. - unstructured
A collection of news articles on a website. - unstructured (or semistructed as these data can have dates, terms, authors etc)
Inventory data in a relational database. - structured
Recorded interviews from a market research study. - unstructured (if without estimates or sentiment analysis)

*Exercise 2*

For each of the following unstructured data sources, propose a method to convert it into structured data. Explain your reasoning.

A series of blog posts about travel experiences. - We can crate a structures data as Post ID', 'Author', 'Location', 'Sentiment', 'Keywords', 'Date', etc., using NLP (text extraction, topic modeling, sentiment analysis, and named entity recognition (NER))
Audio recordings of customer service calls. - Converting it into structured text (peech-to-Text (STT) + NLP Analysis)
Handwritten notes from a brainstorming session. - Text extraction (Optical Character Recognition (OCR) + NLP)
A video tutorial on cooking. - Video to text (Video-to-Text (Speech Recognition))

*Exercise 3*

Import the train dataset. Use the train.csv file.
Print the first few rows of the DataFrame.

In [4]:
import pandas as pd

df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

*Exercise 4*

Use the Iris Dataset CSV.

Download the Iris dataset CSV file and place it in the same directory as your Jupyter Notebook.
Import the CSV file using Pandas.
Display the first five rows of the dataset.

In [7]:
df2 = pd.read_csv('Iris_dataset.csv', header=None)
df2.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

*Exercise 5*

Create a simple dataframe.
Export the dataframe to an excel file.
Export the dataframe to a JSON file.

In [11]:
from faker import Faker
import numpy as np

fake = Faker()
data = [(fake.word(), np.random.randint(10, 300), fake.date_this_year()) for _ in range(100)]
sales_data = pd.DataFrame(data, columns=['Product', 'Price, $', 'Date'])

sales_data.head()

    Product  Price, $        Date
0      hand        59  2025-01-07
1    sister        76  2025-01-27
2   various       140  2025-02-04
3     prove        35  2025-02-15
4  training       195  2025-01-14

In [16]:
# Export the dataframe to an excel file
sales_data.to_excel('Fake_data.xlsx', sheet_name='Sheet1', index=False)

In [ ]:
# Export the dataframe to a JSON file.
sales_data.to_json('Fake_data_2.json', orient='split', index=False)

In [ ]:
# Export the dataframe to a JSON file.
sales_data.to_json('Fake_data_3.json', orient='records')

*Exercise 6*

Use a sample JSON dataset

Import the JSON data from the provided URL.
Use Pandas to read the JSON data.
Display the first five entries of the data.

In [20]:
df_posts = pd.read_json('posts.json')

df_posts.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...